app/controllers/admin/link_pages_controller.rb

  def index
    @link_pages = LinkPage.all
---
SELECT * FROM "link_pages"

  def show
    @link_page = LinkPage.find(params[:id])
---
SELECT * FROM "link_pages" WHERE ("link_pages"."id" = 2)

  def edit
    @link_page = LinkPage.find(params[:id])
---
SELECT * FROM "link_pages" WHERE ("link_pages"."id" = 1)

  def create
    @link_page = LinkPage.new(params[:link_page])
    @link_page.sequence = LinkPage::NOT_USED
    respond_to do |format|
      if @link_page.save
---
INSERT INTO "link_pages" ("name", "created_at", "updated_at", "content", "is_link", "visible") VALUES('facebook', '2010-12-01 17:55:46', '2010-12-01 17:55:46', 'facebook.com', 't', 't')

  def destroy
    @link_page = LinkPage.find(params[:id])
    @link_page.destroy
---
SELECT * FROM "link_pages" WHERE ("link_pages"."id" = 2)
DELETE FROM "link_pages" WHERE "id" = 2

  def load_page
    @page = LinkPage.find(params[:id])
---
SELECT * FROM "link_pages" WHERE ("link_pages"."id" = 2)