app/controllers/admin/menu_bars_controller.rb

  def index
    @menu_bars = MenuBar.all
---
SELECT * FROM "menu_bars"

  def show
    @menu_bar = MenuBar.find(params[:id])
---
SELECT * FROM "menu_bars" WHERE ("menu_bars"."id" = 2)

  def edit
    @menu_bar = MenuBar.find(params[:id])
    @link_pages = LinkPage.find(:all, :conditions => "sequence = #{LinkPage::NOT_USED}", :order => :sequence)
---
SELECT * FROM "menu_bars" WHERE ("menu_bars"."id" = 1)
SELECT * FROM "link_pages" WHERE (sequence = -1) ORDER BY sequence

  def create
    @menu_bar = MenuBar.new(params[:menu_bar])

    respond_to do |format|
      if @menu_bar.save
---
INSERT INTO "menu_bars" ("created_at", "is_horizontal", "updated_at") VALUES('2010-12-01 19:37:52', 't', '2010-12-01 19:37:52')

  def destroy
    @menu_bar = MenuBar.find(params[:id])
---
SELECT * FROM "menu_bars" WHERE ("menu_bars"."id" = 2)

  def add_page_to_menu
    @menu_bar = MenuBar.find(params[:id])
    @page = LinkPage.find(params[:page])

    @page.sequence = @menu_bar.link_pages.size + 1
    @page.save
---
SELECT * FROM "menu_bars" WHERE ("menu_bars"."id" = 1)
SELECT * FROM "link_pages" WHERE (sequence = -1) ORDER BY sequence
SELECT * FROM "link_pages"
UPDATE "link_pages" SET "updated_at" = '2010-12-26 22:20:42', "sequence" = 1 WHERE "id" = 1

  def sort_pages
    params[:page].each_with_index do |pageID, index|
      page = LinkPage.find(pageID)
      page.sequence = index
      page.save
---
SELECT * FROM "link_pages" WHERE ("link_pages"."id" = 1)
UPDATE "link_pages" SET "updated_at" = '2010-12-26 23:39:19', "sequence" = 0 WHERE "id" = 1

  def remove_page_from_menu
    @menu_bar = MenuBar.find(params[:id])
    page = LinkPage.find(params[:page])

    page.sequence = LinkPage::NOT_USED
    page.save
---
SELECT * FROM "menu_bars" WHERE ("menu_bars"."id" = 1)
SELECT * FROM "link_pages" WHERE (sequence = -1) ORDER BY sequence
UPDATE "link_pages" SET "updated_at" = '2010-12-26 23:41:21', "sequence" = -1 WHERE "id" = 7