app/controllers/admin/services_controller.rb

SELECT * FROM "services"
---
  def index
    @services = Service.all

INSERT INTO "services" ("name", "created_at", "updated_at", "description") VALUES('Baby Sitting', '2010-12-25 02:49:00', '2010-12-25 02:49:00', 'RAWR!')
---
  def create
    @service = Service.new(params[:service])

    respond_to do |format|
      if @service.save

SELECT * FROM "services" WHERE ("services"."id" = 2)
DELETE FROM "services" WHERE "id" = 2
---
  def destroy
    @service = Service.find(params[:id])
    @service.destroy