app/controllers/admin/site_prefs_controller.rb

  def index
    @users = User.all
    @services = Service.all
    @pages = LinkPage.all
    @menus = MenuBar.all
---
SELECT * FROM "users"
SELECT * FROM "services"
SELECT * FROM "link_pages"
SELECT * FROM "menu_bars"