app/controllers/site_admin/admin_controller.rb

SELECT * FROM "users"
SELECT * FROM "services"
---
  def index
    @users = User.all
    @services = Service.all