app/controllers/addresses_controller.rb

  def create
    @address = Address.new(params[:address])
    @address.user_id = params[:user_id]
    if @address.save
---
INSERT INTO "addresses" ("number", "city", "zip_code", "street", "user_id", "state") VALUES('202', 'Rockford', '55373', 'Biscayne', NULL, 'MN')