app/controllers/services_controller.rb

  def index
    @services = Service.all
---
SELECT * FROM "services"

  def show
    @service = Service.find(params[:id])
---
SELECT * FROM "services" WHERE ("services"."id" = 1)

  def create
    @service = Service.new(params[:service])

    respond_to do |format|
      if @service.save
---
INSERT INTO "services" ("name", "created_at", "updated_at", "description") VALUES('Baby Sitting', '2010-11-25 17:38:56', '2010-11-25 17:38:56', 'Watching Babies while parents are away.')

  def search
    if (params[:search].length > 0)
      conditions = ["(name like ? or description like ?)",
        "%#{params[:search]}%", "%#{params[:search]}%"]
    end

    respond_to do |format|
      format.html {
        @services = Service.all(:conditions => conditions)
---
SELECT * FROM "services" WHERE ((name like '%sit%' or description like '%sit%'))