app/controllers/services_controller.rb

  def single_service_search

    respond_to do |format|
      format.js do
        render :update do |p|
          @service = Service.find(params[:search])
---
SELECT * FROM "services" WHERE ("services"."id" = 6)