app/controllers/user_sessions_controller.rb

  def create
    user  = User.find_by_login(params[:user_session][:login])
---
SELECT * FROM "users" WHERE (LOWER("users".login) = 'dernalia') LIMIT 1