app/controllers/users_controller.rb

  def new
    @user = User.new

    ip_is_blocked = false

    blocked_people = User.find(:all, :conditions => ["is_not_allowed_to_login = 't'"])
---
SELECT * FROM "users" WHERE (LOWER("users".login) = 'admin') LIMIT 1

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "real_name", "crypted_password", "membership", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "phone_number", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('ddxgkJ1FRWhpszvqQMT', '2010-12-23 20:22:46', '2010-12-23 20:22:46', 'L. Preston Sego III', 'f6ee4c0a3a623e783363268502382a959841dd15f5449c3210d1fd85f00db367756c33038deabefd5d5d115d1c9e3fd0c7fd801411ec2c4d4130d8ad958e2c3d', 0, 'K7kKn9zaIklbKjWpyKwb', '2010-12-23 20:22:46', 0, '127.0.0.1', '7rIELEjBDjkejuVD9wZC', '2010-12-23 20:22:46', '235235', '05bcb05ddb9c97c3023aedd064882c47df34bbd4195d7f06b4595db5bfcdf5cf282b8f3b8b6814dc0eb7c4c3a0c990ae21da91ce97b6053f1a59aad18fae05ca', 1, NULL, 'DerNalia3', NULL, 'seg3olp@rose-hulman.edu')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "login_count" = 3, "persistence_token" = '2033fef0921f8d540bda834d966687b4bbf407ee7ff256ccddae2e2c25ffb28e8cd5a2a2aba90e65778573dde298849e8eaf5033245f20575308193577b85feb', "updated_at" = '2010-11-26 00:29:40', "perishable_token" = 'PTA61xdKH0klSDGjFB', "real_name" = 'L. Preston Sego III', "last_request_at" = '2010-11-26 00:29:40', "phone_number" = '7637424617', "last_login_at" = '2010-11-23 19:22:26', "current_login_at" = '2010-11-26 00:29:40', "password_salt" = 'xHycwgqDUrZyzgnXfN9', "crypted_password" = '10b9e549dabf175fd6e5ce02519236b841bce3f64c09cf08d8adfc5904b0a6d19fcbc24492cfe1c60ec2c425db902f65f0712a56543d7488c27d8e0a3be5abb2' WHERE "id" = 2

  def add_service_to_user
    @user = User.find(params[:user_id])
    @user.services << Service.find(params[:services])
    if @user.save
---
SELECT * FROM "users" WHERE ("users"."id" = 2)
SELECT * FROM "services" WHERE ("services"."id" = 2)
UPDATE "users" SET "updated_at" = '2010-11-26 07:51:00', "perishable_token" = 'f0eOSd9lYrRkKg43pz' WHERE "id" = 2